README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>cl-libconfig</title>
<!-- 2016-08-05 Пт 17:39 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Oleg Shalaev" />
</head>
<body>
<div id="content">
<h1 class="title">cl-libconfig</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Quick start</a></li>
<li><a href="#sec-2">2. Functions</a>
<ul>
<li><a href="#sec-2-1">2.1. read-file</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Macros</a>
<ul>
<li><a href="#sec-3-1">3.1. with-read-config-file</a></li>
<li><a href="#sec-3-2">3.2. with-write-config-file</a></li>
<li><a href="#sec-3-3">3.3. read-setting</a></li>
<li><a href="#sec-3-4">3.4. with-rw-config-file</a></li>
<li><a href="#sec-3-5">3.5. write-structure</a></li>
<li><a href="#sec-3-6">3.6. remove-setting</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Exceptions (conditions)</a>
<ul>
<li><a href="#sec-4-1">4.1. conf-file-read-error</a></li>
<li><a href="#sec-4-2">4.2. config-parse-error</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
This package allows using standard <a href="http://www.hyperrealm.com/libconfig/">libconfig</a> library in Common LISP.
Requires linux libconfig-dev package.
</p>

<p>
<a href="http://www.hyperrealm.com/libconfig/">libconfig</a> supports several important data types, see write-structure description below.
Apart from its usage as a handy configuration tool, <a href="http://www.hyperrealm.com/libconfig/">libconfig</a> is also a universal
language for communication between programs written in different programming languages
and in different OS.
</p>

<p>
Note that <a href="http://www.hyperrealm.com/libconfig/libconfig_manual.html">libconfig is not thread-safe</a>.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Quick start</h2>
<div class="outline-text-2" id="text-1">
<p>
I assume that sbcl is already installed and quicklisp resides in home directory.
lisp is also installed locally, <code>~/local/bin/sbcl</code>
</p>
<ol class="org-ol">
<li>Install <code>libconfig-dev</code>:
<div class="org-src-container">

<pre class="src src-sh">apt-get install libconfig-dev
</pre>
</div>
</li>
<li>download the code (I assume that your quicklisp directory is <code>~/quicklisp/</code>):
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #483d8b;">cd</span> ~/quicklisp/local-projects/
git clone https://github.com/chalaev/cl-libconfig
mv cl-libconfig/tests ~/test-cl-libconfig
</pre>
</div>
</li>
<li>Ensure that the tests are running ok:
<div class="org-src-container">

<pre class="src src-sh">~/local/bin/sbcl --load read.lisp
~/local/bin/sbcl --load write.lisp
~/local/bin/sbcl --load change.lisp
</pre>
</div>
</li>
<li>Now examine <code>~/test-cl-libconfig/*.lisp</code>, <code>read-1.conf</code> and (newly created) <code>change.conf</code>
   The test files are designed to be self-explanatory…
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Functions</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> read-file</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Syntax: (read-file fileName)
Reads entire conf-file named fileName into the hash-table.
See usage example in tests/read.lisp
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Macros</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> with-read-config-file</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Syntax: (with-read-config-file fileName body)
where fileName is the name of the conf-file to read (the conf-file must comply with the standard libconfig syntax).
Inside this macro, macro read-setting can be used.
See usage example in tests/read.lisp
</p>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> with-write-config-file</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Syntax: (with-write-config-file fileName body)
where fileName is the name of the conf-file to write.
This conf-file will be newly created; an existing file wil be ovewritten.
Inside this macro, function write-structure can be used.
See usage example in tests/write.lisp
</p>
</div>
</div>
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> read-setting</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Syntax: (read-setting parName [default])
where parName is the name of the parameter from the conf-file,
and optional default parameter specifies the value to be returned in case the
parameter is not found in the conf-file.
See usage example in tests/read.lisp
</p>
</div>
</div>
<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> with-rw-config-file</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Syntax: (with-rw-config-file fileName body)
with-rw-config-file is similar to with-read-config-file and with-write-config-file;
First, it reads conf-file named fileName (which must exist or the condition conf-file-read-error is raised).
In the body one can read/erase/write conf-parameters like it is done
inside "with-read-config-file" and "with-write-config-file" environments.
See usage example in tests/change.lisp
</p>
</div>
</div>
<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> write-structure</h3>
<div class="outline-text-3" id="text-3-5">
<p>
(To be used from inside of "with-rw-config-file" and "with-write-config-file" macros.)
Syntax: (write-structure parName value)
where value must have one of the following types:
integer string boolean cons hash single-float double-float ratio,
The value parameter can also have nested structure:
for example, it can be an array/hash of any of above-enumerated types.
See usage examples in tests/write.lisp and tests/change.lisp
</p>
</div>
</div>

<div id="outline-container-sec-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> remove-setting</h3>
<div class="outline-text-3" id="text-3-6">
<p>
(To be used from inside of with-rw-config-file macro.)
Removes a setting.
Syntax: (remove-setting parName)
where parName is the name of the setting which we want to remove.
See usage example in tests/change.lisp
</p>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Exceptions (conditions)</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> conf-file-read-error</h3>
<div class="outline-text-3" id="text-4-1">
<p>
This condition occurs when the conf-file does not exist or is unreadable.
See usage example in tests/read.lisp
</p>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> config-parse-error</h3>
<div class="outline-text-3" id="text-4-2">
<p>
This condition occurs when the conf-file has grammar errors.
This often happens for the conf-files that have been writen manually.
An extra bracket, brace, or a missing semicolon in the conf-file will raise this condition.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Oleg Shalaev</p>
<p class="date">Created: 2016-08-05 Пт 17:39</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
